//
//  FoodsData.swift
//  Lecture 7 Homework
//
//  Created by Erik Baliov on 4.08.17.
//  Copyright © 2017 None. All rights reserved.
//

import Foundation

enum FoodsTypes: String {
    case name = "name"
    case recipe = "recipe"
    case duration = "duration"
    case image = "image"
    case favorite = "no"
}

class FoodsData {
    static var foods: [[FoodsTypes:String]] =
        [[.name:"Баница със сирене", .recipe:"1 пакет точени кори 300 г краве сирене 4 яйца 1 кофичка кисело мляко 1 к. л. сода бикарбонат 100 мл олио масло сол на вкус", .duration:"1 час и 15 минути", .image:"Banica.jpg", .favorite:"no"],
         
         [.name:"Мусака", .recipe:"1 кг картофи 600 г кайма смес 1 глава лук 1 скилидка чесън 200 г пасирани домати от консерва 1 с. л. доматен концентра 1/2 ч. л. чубрица 1/2 ч. л. червен пипер 50 мл олио сол и черен пипер на вкус за заливката: 300 г кисело мляко 2 яйца 1 с. л. брашно 100 г кашкавал сол и черен пипер на вкус", .duration:"1 час и 30 минути", .image:"Musaka.jpg", .favorite:"no"],
    
    
         [.name:"Пълнени гъби с пастет", .recipe:" 6 гъби „Портобело“ 180 г пастет Апетит Compass 50 г сушени домати 4 филийки бял хляб (от багета) 30 г краве масло 30 г сирене „Пармезан“", .duration:"35 минути", .image:"GubiSPastet.jpg", .favorite:"no"],
    
         [.name:"Мини пици пеперони", .recipe:"за тестото: 300 г брашно 100-150 мл топла вода 1/2 пакетче бакпулвер 1 щипка сол зехтин за плънката: 15-16 резена салам „Пеперони” (или друг вид салам или филе) 1/2 топка сирене „Моцарела” 2-3 с. л. доматен сос риган (или чубрица)",.duration: "30-40 минути", .image:"MiniPizzasPeperoni.jpg", .favorite:"no"],
    
         [.name:"Мъфини с череши", .recipe:"1 ч. ч. кисело мляко 1/2 ч. ч. олио 1 яйце 1 ч. ч. захар 2 ч. ч. брашно 1 ч. л. бакпулвер 1 ванилия 200 г череши",.duration: "50 минути", .image:"MufiniSChereshi.jpeg", .favorite:"no"],
    
         [.name:"Динена пица", .recipe:"1 диня 3 праскови 3 нектарини 2 банана 200 г боровинки 200 г малини 200 г къпини 200 г бял шоколад 100 мл ром",.duration: "30 минути", .image:"PizzaWithMelon.jpg", .favorite:"no"],
    
         [.name:"Патладжанени кулички", .recipe:" 2 патладжана (по-дълги и едри) 150 г галета (за овалване) 2/3 ч. ч. брашно (за овалване) 3 яйца размер М (или 2 яйца размер XL) 60 г сирене „Пармезан“ 1/2 връзка босилек 2 стръка магданоз 100 мл зехтин „Помаче“ (за пържене) 4 домата 150 г пушена шунка (или бут на слайсове) 2 топки сирене „Моцарела“ сол и черен пипер на вкус",.duration: "2 часа", .image:"PatladjaneniKulichki.jpeg", .favorite:"no"],
    
    [.name:"Крем с маскарпоне и малини", .recipe:"250 г малини 300 г сирене „Маскарпоне“ 4 с. л. пудра захар 50 мл течна сметана",.duration: "15 минути", .image:"KremSMaskarponeIMalini.jpeg", .favorite:"no"],
    
    [.name:"Постни бонбони с фурми", .recipe:"за бонбоните: 110 г фурми (без костилки) 110 г сурови бадеми (кашу) 1 с. л. чиа за овалване: 3 ч. л. канела 3 ч. л. какао 3 ч. л. шоколадови пръчици 3 ч. л. кокосови стърготини",.duration: "25 минути", .image:"PostniBonboniSFurmi.jpeg", .favorite:"no"],
    
    [.name:"Сандвич от тиквички", .recipe:"50 г пушена сьомга 100 г сирене „Крема“ 2 тиквички 2 с. л. зехтин 1/2 ч. л. риган 1 скилидка чесън босилек сол и черен пипер на вкус",.duration: "45 минути", .image:"SandvichOtTikvichki.jpg", .favorite:"no"],
    
    [.name:"Сандвич с авокадо и козе сирене", .recipe:"2 филийки пълнозърнест хляб (за тост) 1 авокадо няколко листа рукола няколко листа спанак няколко листа маруля козе сирене сос „Песто“ орехи сол и черен пипер на вкус",.duration: "20 минути", .image:"SandvichSAvokadoIKozeSirene.jpg", .favorite:"no"],
    
    [.name:"Чийзкейк торта", .recipe:"1 пакет какаови бисквити (2–3 с. л. се оставят за украса) 20 мл олио (краве масло или прясно мляко) 100 г натурален шоколад 500 мл разбита сладкарска сметана (от нея се отделя малка около 30 г натурално какао на прах 1 пакетче желатин 1 пакетче желатин 1 пакет кръгли какаови бисквити (5–6 цели бисквити се оста 200 г заквасена сметана 2 пакетчета крем сирене 20 мл олио (краве масло или прясно мляко) 100 г натурален шоколад 3–4 с. л. разбита сладкарска сметана (или кисело мляко) 125 г краве масло (1 пакет) 4–5 ягоди (разрязани на половина)",.duration: "3 часа", .image:"ChiizkeikTorta.jpg", .favorite:"no"],
    
    [.name:"Добруджанска салата", .recipe:"100 г бял ориз 1-2 пресни моркова (по-големички) 1 прясна краставица копър за поръсване сол, олио и оцет на вкус (може да замените олиото",.duration: "30 минути", .image:"DobrudjanskaSalata.jpg", .favorite:"no"],
    
    [.name:"Паста с риба тон, маслини и чери домати", .recipe:"300 г паста (талиатели) 100 г черни маслини (без костилки) 100 г чери домати 1 стрък целина 1 връзка магданоз 1 консерва риба тон 100 г грах 1 ч. л. морска сол за соса: 2 глави червен лук 3-4 печурки 1 домат 80 мл зехтин 80 мл соев сос черен пипер, джинджифил на прах, кориандър и чили сос на вкус",.duration: "30 минути", .image:"PastaSRibaTonMasliniICheriDomati.jpeg", .favorite:"no"],
    
    [.name:"Сладкиш с крем сирене и сини сливи", .recipe:"100 г натурален шоколад 125 г краве масло 1 1/2 ч. ч. захар 3 яйца 10 г ванилова захар 1 щипка сол 1 ч. ч. брашно 1 ч. л. бакпулвер 250 г крем сирене 100 г сушени сини сливи",.duration: "1 час и 30 минути", .image:"SladkishSKremSireneISiniSlivi.jpeg", .favorite:"no"]]
    
    static var sortedFoods: [[FoodsTypes:String]] = []
}
